app/controllers/login_controller.rb

  def dosignup

    u = Usuario.new(usuario_params)

    if (u.valid? and u.new_record?)
      u.save
---
INSERT INTO "usuarios" ("usuario", "password_digest", "alias", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "usuario"