app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("usuario", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usuario", "javierlopm"], ["password", "The138rock!"], ["created_at", "2015-05-31 18:24:16.478464"], ["updated_at", "2015-05-31 18:24:16.478464"]]
---
  def create
    @usuario = Usuario.new(usuario_params)



    respond_to do |format|
      if @usuario.save

DELETE FROM "usuarios" WHERE "usuarios"."usuario" = $1  [["usuario", "javierlopm"]]
---
  def destroy
    @usuario.destroy

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."usuario" = $1 LIMIT 1  [["usuario", "javierlopm"]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])